app/controllers/countries_controller.rb

SELECT COUNT(*) FROM "countries"
SELECT  "countries".* FROM "countries" LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
---
  def listaContinentes
    @countries = Country.all

    @valor = params[:escolha]
    if @valor.nil?
      @paises = Country.all.paginate(:page => params[:page], :per_page => 20)

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1204], ["LIMIT", 1]]
---
    def set_country
      @country = Country.find(params[:id])